Revit 2024 API
SectionType Enumeration
 Declares the section data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum SectionType
Visual Basic
Public Enumeration SectionType
Visual C++
public enum class SectionType
Members
Member name | Description
None
Header
Body
Summary
Footer
See Also
Autodesk.Revit.DB Namespace